app/controllers/students_controller.rb

SELECT "students".* FROM "students"
SELECT "students".* FROM "students" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "students"
---
  def index
    @students_print = Student.all
    @students = Student.paginate :page => params[:page], :per_page => 10

INSERT INTO "students" ("classdiscussion", "created_at", "final", "lab", "name", "nickname", "project", "student_id", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(params[:student])
    @student.calc_total

    respond_to do |format|
      if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "students" SET "classdiscussion" = 30, "updated_at" = '2014-10-13 11:23:12.281433' WHERE "students"."id" = 1
---
  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    @student = Student.find(params[:id])
    @student.destroy